app/Http/Helpers.php

    function uploaded_asset($id)
    {
        if (($asset = Upload::find($id)) != null) {
---
select * from `uploads` where `uploads`.`id` is null and `uploads`.`deleted_at` is null limit 1

function translate($key, $lang = null)
{
    if ($lang == null) {
        $lang = App::getLocale();
    }

    $lang_key = preg_replace('/[^A-Za-z0-9\_]/', '', str_replace(' ', '_', strtolower($key)));

    $translations_default = Cache::rememberForever('translations-' . env('DEFAULT_LANGUAGE', 'en'), function () {
        return Translation::where('lang', env('DEFAULT_LANGUAGE', 'en'))->pluck('lang_value', 'lang_key')->toArray();
    });

    if (!isset($translations_default[$lang_key])) {
        $translation_def = new Translation;
        $translation_def->lang = env('DEFAULT_LANGUAGE', 'en');
        $translation_def->lang_key = $lang_key;
        $translation_def->lang_value = $key;
        $translation_def->save();
        Cache::forget('translations-' . env('DEFAULT_LANGUAGE', 'en'));
    }

    $translation_locale = Cache::rememberForever('translations-' . $lang, function () use ($lang) {
        return Translation::where('lang', $lang)->pluck('lang_value', 'lang_key')->toArray();
    });
---
insert into `translations` (`lang`, `lang_key`, `lang_value`, `updated_at`, `created_at`) values ('en', 'payment_proosssf', 'Payment Proosssf', '2025-12-22 09:17:35', '2025-12-22 09:17:35')
select `lang_value`, `lang_key` from `translations` where `lang` = 'en'

    function get_remaining_package_value($id, $colmn_name)
    {
        $value = Member::where('user_id', $id)->first()->$colmn_name;
---
select * from `members` where `user_id` = 716 and `members`.`deleted_at` is null limit 1

    function package_validity($id)
    {
        $package_validity = Member::where('user_id', $id)->first()->package_validity;
---
select * from `members` where `user_id` = 716 and `members`.`deleted_at` is null limit 1

    function convert_price($price)
    {
        $business_settings = Setting::where('type', 'system_default_currency')->first();
        if ($business_settings != null) {
            $currency = Currency::find($business_settings->value);
            $price = floatval($price) / floatval($currency->exchange_rate);
        }

        $code       = Currency::findOrFail(get_setting('system_default_currency'))->code;
---
select * from `settings` where `type` = 'system_default_currency' limit 1
select * from `currencies` where `currencies`.`id` = '28' and `currencies`.`deleted_at` is null limit 1
select * from `currencies` where `code` = 'Rupee' and `currencies`.`deleted_at` is null limit 1

    function currency_symbol()
    {
        $code       = Currency::findOrFail(get_setting('system_default_currency'))->code;
---
select * from `currencies` where `code` = 'Rupee' and `currencies`.`deleted_at` is null limit 1

    function chat_threads()
    {
        $data  = array();
        if (Auth::check()) {
            foreach (ChatThread::where('sender_user_id', Auth::user()->id)->orWhere('receiver_user_id', Auth::user()->id)->get() as $key => $chat_thread) {
---
select * from `chat_threads` where (`sender_user_id` = 600 or `receiver_user_id` = 600) and `chat_threads`.`deleted_at` is null