app/Http/Controllers/Api/AuthController.php

select * from `users` where (`email` = 'jayapriyauma@gmail.com' or `phone` = 'jayapriyauma@gmail.com') and `users`.`deleted_at` is null limit 1
---
    public function signin(Request $request)
    {
        $user = User::where('email', $request->email_or_phone)
            ->orWhere('phone', $request->email_or_phone)
            ->first();

select * from `marital_statuses` where `id` = 2 and `marital_statuses`.`deleted_at` is null limit 1
select * from `members` where `members`.`user_id` = 708 and `members`.`user_id` is not null and `members`.`deleted_at` is null limit 1
select * from `physical_attributes` where `physical_attributes`.`user_id` = 708 and `physical_attributes`.`user_id` is not null and `physical_attributes`.`deleted_at` is null limit 1
---
    protected function authResponse($user)
    {
        $maritial_status = MaritalStatus::where('id', $user->member->marital_status_id)->first();
        $token = $user->createToken('API Token')->plainTextToken;
        $age = Carbon::parse($user->member->birthday)->age;

        return response()->json([
            'result' => true,
            'message' => translate('Successfully logged in'),
            'access_token' => $token,
            'token_type' => 'Bearer',
            'expires_at' => null,
            'user' => [
                'id' => $user->id,
                'type' => $user->user_type,
                'name' => $user->first_name . ' ' . $user->last_name,
                'membership' => $user->membership,
                'email_verified_at' => $user->email_verified_at,
                'photo_approved' => $user->photo_approved,
                'blocked' => $user->blocked,
                'deactivated' => $user->deactivated,
                'approved' => $user->approved,
                'email' => $user->email,
                'birthday' => $age,
                'height' => $user->physical_attributes ? $user->physical_attributes->height : 0,
                'marital_status_id' => $maritial_status ? new MaritialStatusResource($maritial_status) :  new MaritialStatusResource($maritial_status),
                'avatar' => $user->avatar ?? '',
                'avatar_original' => uploaded_asset($user->avatar_original) ?? '',
                'phone' => $user->phone ?? '',
                'isInitialPaymentPaid' => $user->isInitialPaymentPaid ?? '',
            ],