app/Http/Controllers/Api/HomeController.php

    public function home_with_login()
    {
        $members = User::query();
        $members->where('user_type', 'member')
            ->where('approved', 1)
            ->where('blocked', 0)
            ->where('deactivated', 0);

        if (auth()->user() && auth()->user()->user_type == 'member') {
            $members->where('id', '!=', auth()->user()->id)
                ->whereIn("id", function ($query) {
                    $query->select('user_id')
                        ->from('members')
                        ->where('gender', '!=', auth()->user()->member->gender);
                });

            $ignored_to = IgnoredUser::where('ignored_by', auth()->user()->id)->pluck('user_id')->toArray();
            if (count($ignored_to) > 0) {
                $members->whereNotIn('id', $ignored_to);
            }

            $ignored_by_ids = IgnoredUser::where('user_id', auth()->user()->id)->pluck('ignored_by')->toArray();
            if (count($ignored_by_ids) > 0) {
                $members->whereNotIn('id', $ignored_by_ids);
            }
        }

        $members = $members->orderBy('id', 'desc')->limit(15)->get()->shuffle();
---
select `ignored_by` from `ignored_users` where `user_id` = 700
select * from `users` where `user_type` = 'member' and `approved` = 1 and `blocked` = 0 and `deactivated` = 0 and `id` != 700 and `id` in (select `user_id` from `members` where `gender` != '1') and `id` not in (695) and `users`.`deleted_at` is null order by `id` desc limit 15

    public function feature_check()
    {
        /*
        $features['google_login']             = get_setting('google_login_activation') == 1 ? true : false;
        $features['facebook_login']           = get_setting('facebook_login_activation') == 1 ? true : false;
        $features['twitter_login']            = get_setting('twitter_login_activation') == 1 ? true : false;
        $features['apple_login']              = get_setting('apple_login_activation') == 1 ? true : false;
        $features['force_https']              = get_setting('FORCE_HTTPS') == 1 ? true : false;
        $features['maintenance_mode']         = get_setting('maintenance_mode') == 1 ? true : false;
        $features['wallet_system']            = get_setting('wallet_system') == 1 ? true : false;
        $features['full_profile_show']        = get_setting('full_profile_show_according_to_membership') == 1 ? true : false;
        $features['profile_picture_approval'] = get_setting('profile_picture_approval_by_admin') == 1 ? true : false;
        $features['gallery_image_privacy']    = get_setting('gallery_image_privacy');
        $features['profile_picture_privacy']  = get_setting('profile_picture_privacy');
        $features['email_verification']       = get_setting('email_verification') == 1 ? true : false;
        $features['member_verification']      = get_setting('member_verification') == 1 ? true : false;
        $features['member_min_age']           = get_setting('member_min_age') ?? "";
        $features['default_currency']         = \App\Models\Currency::findOrFail(get_setting('system_default_currency'))->symbol;
        */
        $features = Setting::all();
---
select * from `settings`