app/Http/Controllers/Api/MemberController.php

     public function isApproved(){
        $user = User::where('id',  auth()->user()->id)->first();
---
select * from `users` where `id` = 700 and `users`.`deleted_at` is null limit 1