app/Http/Controllers/Api/PackageController.php

select * from `packages` where `active` = '1' and `packages`.`deleted_at` is null
---
    public function active_packages()
    {
        $packages = Package::where('active', '1');
        if (get_setting('free_package_activation') != 1) {
            $packages = $packages->where('id', '!=', 1);
        }
        $packages = $packages->get();