app/Http/Controllers/Api/ProfileController.php

select * from `users` where `id` = '708' and `users`.`deleted_at` is null limit 1
select * from `members` where `members`.`user_id` = 708 and `members`.`user_id` is not null and `members`.`deleted_at` is null limit 1
select * from `member_languages` where `id` in (1, 6) and `member_languages`.`deleted_at` is null
select * from `member_languages` where `id` = 1 and `member_languages`.`deleted_at` is null limit 1
select * from `view_profile_pictures` where `user_id` = 708 and `requested_by` = 708 limit 1
select * from `addresses` where `user_id` = '708' and `type` = 'present' and `addresses`.`deleted_at` is null limit 1
---
    public function public_profile($id)
    {
        $user = User::where('id', $id)->first();
        $auth_user = auth()->user();
        if ($user) {
            $member_known_languages = null;
            $member_mother_tongue = null;
            $known_languages = json_decode($user->member->known_languages);
            $mother_tongue = json_decode($user->member->mothere_tongue);
            if ($known_languages != null) {
                $member_known_languages = LanguageResource::collection(MemberLanguage::whereIn('id', $known_languages)->get());
            }
            if ($mother_tongue != null) {
                $member_mother_tongue = new LanguageResource(MemberLanguage::where('id', $mother_tongue)->first());
            }
            $data['intoduction'] = new AboutUser($user);
            $data['basic_info'] = new BasicInformation($user);

            $profile_pic_privacy = get_setting('profile_picture_privacy');
            $photo_view_request = ViewProfilePicture::where('user_id', $user->id)->where('requested_by', $auth_user->id)->first();
            $data['profile_pic_request'] = $user->photo != null && $user->photo_approved == 1 && $profile_pic_privacy == 'only_me' && ($photo_view_request == null || ($photo_view_request && $photo_view_request->status == 0));

            $data['present_address'] = Address::where('user_id', $id)->where('type', 'present')->first() ? new AddressResource(Address::where('user_id', $id)->where('type', 'present')->first()) : null;

select `astrologies`.*, `sun_signs`.`id` as `sun_sign_id`, `sun_signs`.`name` as `sun_sign_name`, `moon_signs`.`id` as `moon_sign_id`, `moon_signs`.`name` as `moon_sign_name`, `lagnam_sun_signs`.`id` as `lagnam_id`, `lagnam_sun_signs`.`name` as `lagnam_name` from `astrologies` left join `sun_signs` on (`astrologies`.`sun_sign` = CAST(sun_signs.id AS CHAR) or `astrologies`.`sun_sign` = `sun_signs`.`name`) left join `moon_signs` on (`astrologies`.`moon_sign` = CAST(moon_signs.id AS CHAR) or `astrologies`.`moon_sign` = `moon_signs`.`name`) left join `sun_signs` as `lagnam_sun_signs` on (`astrologies`.`lagnam` = CAST(lagnam_sun_signs.id AS CHAR) or `astrologies`.`lagnam` = `lagnam_sun_signs`.`name`) where `user_id` = 708 and `astrologies`.`deleted_at` is null limit 1
select * from `addresses` where `user_id` = '708' and `type` = 'permanent' and `addresses`.`deleted_at` is null limit 1
select * from `gallery_images` where `user_id` = 708
select * from `view_gallery_images` where `user_id` = 708 and `requested_by` = 708 limit 1
---
            $data['spiritual_backgrounds'] = $user->spiritual_backgrounds ? new SpiritualSocialBackground($user->spiritual_backgrounds) : null;
            $data['lifestyles'] = $user->lifestyles ? new LifeStyleResource($user->lifestyles) : null;
            // Fetch astrologies with left joins for sun_sign, moon_sign, and lagnam
            $astrologies = Astrology::where('user_id', $user->id)
                ->leftJoin('sun_signs', function($join) {
                    $join->where(function($query) {
                        $query->whereColumn('astrologies.sun_sign', DB::raw('CAST(sun_signs.id AS CHAR)'))
                              ->orWhereColumn('astrologies.sun_sign', 'sun_signs.name');
                    });
                })
                ->leftJoin('moon_signs', function($join) {
                    $join->where(function($query) {
                        $query->whereColumn('astrologies.moon_sign', DB::raw('CAST(moon_signs.id AS CHAR)'))
                              ->orWhereColumn('astrologies.moon_sign', 'moon_signs.name');
                    });
                })
                ->leftJoin('sun_signs as lagnam_sun_signs', function($join) {
                    $join->where(function($query) {
                        $query->whereColumn('astrologies.lagnam', DB::raw('CAST(lagnam_sun_signs.id AS CHAR)'))
                              ->orWhereColumn('astrologies.lagnam', 'lagnam_sun_signs.name');
                    });
                })
                ->select(
                    'astrologies.*',
                    'sun_signs.id as sun_sign_id',
                    'sun_signs.name as sun_sign_name',
                    'moon_signs.id as moon_sign_id',
                    'moon_signs.name as moon_sign_name',
                    'lagnam_sun_signs.id as lagnam_id',
                    'lagnam_sun_signs.name as lagnam_name'
                )
                ->first();

            $data['astrologies'] = $astrologies ? new AstronomicInformation($astrologies) : null;
            $data['permanent_address'] = Address::where('user_id', $id)->where('type', 'permanent')->first() ? new AddressResource(Address::where('user_id', $id)->where('type', 'permanent')->first()) : null;
            $data['families_information'] = $user->families ? new FamilyInformation($user->families) : null;
            $data['partner_expectation'] = $user->partner_expectations ? new PartnerExpectationResource($user->partner_expectations) : null;

            $gallery_images = GalleryImage::where('user_id', $user->id)->get();
            $gallery_image_privacy = get_setting('gallery_image_privacy');
            $gallery_image_request = ViewGalleryImage::where('user_id', $user->id)->where('requested_by', $auth_user->id)->first();

select * from `profile_matches` where `user_id` = 708 and `match_id` = 708 limit 1
select * from `view_contacts` where `user_id` = 708 and `viewed_by` = 708 limit 1
---
            }

            $data['profile_match'] = null;
            $profile_match = ProfileMatch::where('user_id', $auth_user->id)
                ->where('match_id', $user->id)
                ->first();
            if (!empty($profile_match) && $auth_user->member->auto_profile_match == 1) {
                $data['profile_match'] = $profile_match->match_percentage;
            }
            $data['view_contact_check'] = ViewContact::where('user_id', $user->id)->where('viewed_by', auth()->id())->first() ? true : false;