app/Http/Controllers/Api/ProfileDropdownController.php

select * from `marital_statuses` where `marital_statuses`.`deleted_at` is null order by `created_at` desc
select * from `member_languages` where `member_languages`.`deleted_at` is null
select * from `religions` where `religions`.`deleted_at` is null
select * from `family_values` where `family_values`.`deleted_at` is null
select * from `countries` where `status` = 1 and `countries`.`deleted_at` is null
---
    public function profile_dropdown(){
        $data['onbehalf_list'] = OnBehalfResource::collection(OnBehalf::latest()->get());
        $data['maritial_status'] = MaritialStatusResource::collection(MaritalStatus::latest()->get());
        $data['language_list'] = LanguageResource::collection(MemberLanguage::all());
        $data['religion_list'] = ReligionResource::collection(Religion::all());
        $data['family_value_list'] = FamilyValuesResource::collection(FamilyValue::all());
        $data['country_list'] = CountryResource::collection(Country::where('status',1)->get());