app/Http/Resources/MemberResource.php

    public function toArray($request)
    {
        if ($this->member != null) {
            $token = PersonalAccessToken::findToken(request()->bearerToken());
            $user = null;
            if ($token) {
                $user = $token->tokenable;
            }

            $profile_view_resquest_status = ViewProfilePicture::where('user_id', $this->id);
            if ($token) {
                $profile_view_resquest_status->where('requested_by', $user->id);
            }
            $profile_view_resquest_status->where('status', 1)->first();

            $gallery_view_resquest_status = ViewGalleryImage::where('user_id', $this->id);
            if ($token) {
                $gallery_view_resquest_status->where('requested_by', $user->id);
            }
            $gallery_view_resquest_status->where('status', 1)->first();

            $avatar_image = $this->member->gender == 1 ? 'assets/img/avatar-place.png' : 'assets/img/female-avatar-place.png';

            $profile_picture_show = show_profile_picture($this); //something is wrong

            $package_update_alert = ($token && $user) ? is_profile_viewer_view_blocked($user) : false;


            if ($token) {
                $shortlist = Shortlist::where('user_id', $this->id)->where('shortlisted_by', $user->id)->first();
---
select * from `view_profile_pictures` where `user_id` = 794 and `requested_by` = 700 and `status` = 1 limit 1
select * from `view_gallery_images` where `user_id` = 794 and `requested_by` = 700 and `status` = 1 limit 1
select * from `shortlists` where `user_id` = 794 and `shortlisted_by` = 700 limit 1

            // $shortlist->first();

            if ($token) {
            $do_interest = ExpressInterest::where('user_id', $this->id)->where('interested_by', $user->id)->first();
---
select * from `express_interests` where `user_id` = 794 and `interested_by` = 700 limit 1



            if ($token) {
                $received_interest = ExpressInterest::where('interested_by', $this->id)->where('user_id', $user->id)->first();
---
select * from `express_interests` where `interested_by` = 794 and `user_id` = 700 limit 1


            $profile_reported = ReportedUser::where('user_id', $this->id);
            if ($token) {
                $profile_reported->where('reported_by', $user->id);
---
select * from `reported_users` where `user_id` = 794 and `reported_by` = 700 limit 1