app/Http/Resources/PublicProfile/BasicInformation.php

select * from `marital_statuses` where `marital_statuses`.`id` = 2 limit 1
select * from `castes` where `castes`.`id` = 4 limit 1
select * from `religions` where `religions`.`id` = 7 limit 1
select * from `on_behalves` where `on_behalves`.`id` = 6 and `on_behalves`.`deleted_at` is null limit 1
---
    public function toArray($request)
    {

        $age = Carbon::parse($this->member->birthday)->age;
        return [
            'firs_name' => $this->first_name,
            'last_name' => $this->last_name,
            'code' => $this->code,
            'age' => $age,
            'religion' => $this->spiritual_backgrounds->religion->name ?? '',
            'caste' => $this->spiritual_backgrounds->caste->name ?? '',
            'date_of_birth' => Carbon::parse($this->member->birthday)->format('Y-m-d'),
            'onbehalf' => new OnBehalfResource(OnBehalf::find($this->member->on_behalves_id)),
            'no_of_children' => $this->member->children ?? '',
            'gender' => $this->member->gender == 1 ? "Male" : "Female",
            'phone' => $this->phone ?? "",
            'maritial_status' =>  $this->member->marital_status ? $this->member->marital_status->name : '',
            'photo' => show_profile_picture($this) ? uploaded_asset($this->photo) : static_asset(($this->member && $this->member->gender == 2 ? 'assets/img/female-avatar-place.png' : 'assets/img/avatar-place.png')),

        ];