app/Http/Controllers/AizUploadController.php

    public function get_preview_files(Request $request){
        $ids = explode(',', $request->ids);
        $files = Upload::whereIn('id', $ids)->get();
---
select * from `uploads` where `id` in ('112') and `uploads`.`deleted_at` is null