app/Http/Controllers/ContactUsController.php

    public function store(ContactUsRequest $request)
    {
        ContactUs::create($request->except('g-recaptcha-response'));
        $user = User::where('user_type', 'admin')->first();
---
insert into `contact_us` (`name`, `email`, `subject`, `description`, `updated_at`, `created_at`) values ('Denese', 'sales@camden.tidbuy.com', 'Denese Camden', 'Morning \r\n \r\nIs your dog\'s nails getting too long? If you\'re tired of going to the vet or groomer to get them trimmed, why not try PawSafer™? \r\nWith PawSafer™, you can trim your dog\'s nails from the comfort of your own home, and it only takes a few minutes!\r\n\r\nPawSafer™ is the safest and most convenient way to trim your dog\'s nails, and it\'s very affordable. \r\n\r\nGet it while it\'s still 50% OFF + FREE Shipping\r\n\r\nBuy here: https://tidbuy.com\r\n \r\nSincerely, \r\n \r\nDenese', '2025-12-21 16:47:14', '2025-12-21 16:47:14')
select * from `users` where `user_type` = 'admin' and `users`.`deleted_at` is null limit 1