app/Http/Controllers/ExpressInterestController.php

select count(*) as aggregate from `express_interests` inner join `users` on `express_interests`.`user_id` = `users`.`id` where `interested_by` = 600
select distinct `express_interests`.`id` from `express_interests` inner join `users` on `express_interests`.`user_id` = `users`.`id` where `interested_by` = 600 order by `id` desc limit 10 offset 0
---
    public function index()
    {
        $interests = DB::table('express_interests')
            ->orderBy('id', 'desc')
            ->where('interested_by', Auth::user()->id)
            ->join('users', 'express_interests.user_id', '=', 'users.id')
            ->select('express_interests.id')
            ->distinct()
            ->paginate(10);