app/Http/Controllers/HomeController.php

    public function index()
    {

        $members = User::where('user_type', 'member')
            ->where('approved', 1)
            ->where('blocked', 0)
            ->where('deactivated', 0);

        if (Auth::user() && Auth::user()->user_type == 'member') {
            $members = $members->where('id', '!=', Auth::user()->id)
                ->whereIn("id", function ($query) {
                    $query->select('user_id')
                        ->from('members')
                        ->where('gender', '!=', Auth::user()->member->gender);
                });

            $ignored_to = IgnoredUser::where('ignored_by', Auth::user()->id)->pluck('user_id')->toArray();
            if (count($ignored_to) > 0) {
                $members = $members->whereNotIn('id', $ignored_to);
            }

            $ignored_by_ids = IgnoredUser::where('user_id', Auth::user()->id)->pluck('ignored_by')->toArray();
---
select `user_id` from `ignored_users` where `ignored_by` = 720
select `ignored_by` from `ignored_users` where `user_id` = 720

    public function dashboard()
    {

        $user = auth()->user();
        if ($user->user_type == 'member') {

            if($user->blocked == 1){
                return redirect()->route('user.blocked');
            }

            $similar_profiles = ProfileMatch::orderBy('match_percentage', 'desc')
                ->where('user_id', $user->id)
                ->where('match_percentage', '>=', 50)
                ->limit(20);

            $ignored_to = IgnoredUser::where('ignored_by', $user->id)->pluck('user_id')->toArray();
            if (count($ignored_to) > 0) {
                $similar_profiles = $similar_profiles->whereNotIn('match_id', $ignored_to);
            }
            $ignored_by_ids = IgnoredUser::where('user_id', $user->id)->pluck('ignored_by')->toArray();
            if (count($ignored_by_ids) > 0) {
                $similar_profiles = $similar_profiles->whereNotIn('match_id', $ignored_by_ids);
            }
            $similar_profiles = $similar_profiles->get();
            $member = User::find(auth()->user()->id);

            $report = AstrologyReport::where('memberId', auth()->user()->id)->first();
---
select `user_id` from `ignored_users` where `ignored_by` = 716
select `ignored_by` from `ignored_users` where `user_id` = 716
select * from `profile_matches` where `user_id` = 708 and `match_percentage` >= 50 and `match_id` not in (687) order by `match_percentage` desc limit 20
select * from `users` where `users`.`id` = 716 and `users`.`deleted_at` is null limit 1
select * from `astrology_reports` where `memberId` = 716 limit 1

    public function member_listing(Request $request)
    {
        $age_from       = ($request->age_from != null) ? $request->age_from : null;
        $age_to         = ($request->age_to != null) ? $request->age_to : null;
        $member_code    = ($request->member_code != null) ? $request->member_code : null;
        $matital_status = ($request->marital_status != null) ? $request->marital_status : null;
        $religion_id    = ($request->religion_id != null) ? $request->religion_id : null;
        $caste_id       = ($request->caste_id != null) ? $request->caste_id : null;
        $sub_caste_id   = ($request->sub_caste_id != null) ? $request->sub_caste_id : null;
        $mother_tongue  = ($request->mother_tongue != null) ? $request->mother_tongue : null;
        $profession     = ($request->profession != null) ? $request->profession : null;
        $country_id     = ($request->country_id != null) ? $request->country_id : null;
        $state_id       = ($request->state_id != null) ? $request->state_id : null;
        $city_id        = ($request->city_id != null) ? $request->city_id : null;
        $min_height     = ($request->min_height != null) ? $request->min_height : null;
        $max_height     = ($request->max_height != null) ? $request->max_height : null;
        $member_type    = ($request->member_type != null) ? $request->member_type : 0;
        $sun_sign_id    = ($request->sun_sign != null) ? $request->sun_sign : null;
        $moon_sign_id   = ($request->moon_sign != null) ? $request->moon_sign : null;
        $lagnam_id      = ($request->lagnam != null) ? $request->lagnam : null;


        $users = User::orderBy('created_at', 'desc')
            ->where('user_type', 'member')
            ->where('id', '!=', Auth::user()->id)
            ->where('blocked', 0)
            ->where('deactivated', 0);

        // Gender Check
        $user_ids = Member::where('gender', '!=', Auth::user()->member->gender)->pluck('user_id')->toArray();
---
select `user_id` from `members` where `gender` != '2' and `members`.`deleted_at` is null

        if (!empty($age_from)) {
            $age = $age_from + 1;
            $start = date('Y-m-d', strtotime("- $age years"));
            $user_ids = Member::where('birthday', '<=', $start)->pluck('user_id')->toArray();
---
select `user_id` from `members` where `birthday` <= '2004-12-22' and `members`.`deleted_at` is null

        if (!empty($age_to)) {
            $age = $age_to + 1;
            $end = date('Y-m-d', strtotime("- $age years +1 day"));
            $user_ids = Member::where('birthday', '>=', $end)->pluck('user_id')->toArray();
---
select `user_id` from `members` where `birthday` >= '1974-12-23' and `members`.`deleted_at` is null

        // Sort by Sun Sign (Rasi)
        if (!empty($sun_sign_id)) {
            // Handle both ID (numeric) and name (string) formats for backward compatibility
            $sun_sign_obj = \App\Models\SunSign::find($sun_sign_id);
            $sun_sign_name = $sun_sign_obj ? $sun_sign_obj->name : '';
            $user_ids = \App\Models\Astrology::where(function($query) use ($sun_sign_id, $sun_sign_name) {
                $query->where('sun_sign', $sun_sign_id);
                if (!empty($sun_sign_name)) {
                    $query->orWhere('sun_sign', $sun_sign_name);
                }
            })->pluck('user_id')->toArray();
---
select * from `sun_signs` where `sun_signs`.`id` = '12' and `sun_signs`.`deleted_at` is null limit 1
select `user_id` from `astrologies` where (`sun_sign` = '12' or `sun_sign` = 'சிம்மம்/Simmam/Leo') and `astrologies`.`deleted_at` is null