app/Http/Controllers/MemberController.php

    public function index(Request $request, $id)
    {
        CoreComponentRepository::instantiateShopRepository();
        CoreComponentRepository::initializeCache();

        $sort_search  = null;
        $members      = User::latest()->where('user_type', 'member')->where('membership', $id);

        if ($request->has('search')) {
            $sort_search  = $request->search;
            $members  = $members->where('code', $sort_search)->orwhere('first_name', 'like', '%' . $sort_search . '%')->orWhere('last_name', 'like', '%' . $sort_search . '%');
        }

        $members = $members->paginate(10);
---
select * from `users` where (`user_type` = 'member' and `membership` = '1' and `code` = 'asha' or `first_name` like '%asha%' or `last_name` like '%asha%') and `users`.`deleted_at` is null order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `users` where (`user_type` = 'member' and `membership` = '1' and `code` = 'asha' or `first_name` like '%asha%' or `last_name` like '%asha%') and `users`.`deleted_at` is null

    public function show($id)
    {
        $member = User::findOrFail(decrypt($id));
        $present_address = Address::where('user_id',$member->id)->where('type','present')->first();
        $educations = Education::where('user_id',$member->id)->orderBy('is_highest_degree', 'desc')->get();
        $careers = Career::where('user_id',$member->id)->orderBy('present', 'desc')->get();
        $permanent_address = Address::where('user_id', $member->id)->where('type', 'permanent')->first();
        $additional_attributes  = AdditionalAttribute::where('status', 1)->get();
---
select * from `users` where `users`.`id` = 709 and `users`.`deleted_at` is null limit 1
select * from `addresses` where `user_id` = 709 and `type` = 'present' and `addresses`.`deleted_at` is null limit 1
select * from `education` where `user_id` = 709 and `education`.`deleted_at` is null order by `is_highest_degree` desc
select * from `careers` where `user_id` = 709 and `careers`.`deleted_at` is null order by `present` desc
select * from `addresses` where `user_id` = 709 and `type` = 'permanent' and `addresses`.`deleted_at` is null limit 1
select * from `additional_attributes` where `status` = 1

    public function introduction_update(Request $request, $id)
    {
        $member = Member::findOrFail($id);
        $member->introduction = $request->introduction;
        if ($member->save()) {
---
select * from `members` where `members`.`id` = '703' and `members`.`deleted_at` is null limit 1
update `members` set `introduction` = 'self introduction', `members`.`updated_at` = '2025-12-22 11:03:54' where `id` = 703

    public function language_info_update(Request $request, $id)
    {
        $member                     = Member::where('user_id', $request->id)->first();
---
select * from `members` where `user_id` = '600' and `members`.`deleted_at` is null limit 1

    public function login($id)
    {
        $user = User::findOrFail(decrypt($id));
---
select * from `users` where `users`.`id` = 600 and `users`.`deleted_at` is null limit 1

    public function profile_settings()
    {
        $data['member']                 = User::findOrFail(Auth::user()->id);
        $data['countries']              = Country::where('status', 1)->get();
        $data['religions']              = Religion::all();
        $data['castes']                 = Caste::all();
        $data['family_values']          = FamilyValue::all();
        $data['marital_statuses']       = MaritalStatus::all();
        $data['on_behalves']            = OnBehalf::all();
        $data['languages']              = MemberLanguage::all();
        $data['additional_attributes']  = AdditionalAttribute::where('status', 1)->get();
        $data['annual_salary_ranges']   = AnnualSalaryRange::orderBy('min_salary','asc')->get();
---
select * from `countries` where `status` = 1 and `countries`.`deleted_at` is null
select * from `religions` where `religions`.`deleted_at` is null
select * from `castes` where `castes`.`deleted_at` is null
select * from `family_values` where `family_values`.`deleted_at` is null
select * from `marital_statuses` where `marital_statuses`.`deleted_at` is null
select * from `on_behalves` where `on_behalves`.`deleted_at` is null
select * from `member_languages` where `member_languages`.`deleted_at` is null
select * from `additional_attributes` where `status` = 1
select * from `annual_salary_ranges` order by `min_salary` asc