app/Http/Controllers/PackagePaymentController.php

select * from `package_payments` where `package_payments`.`deleted_at` is null order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `package_payments` where `package_payments`.`deleted_at` is null
---
    public function index()
    {
        $per_page = 10;
        $package_payments = PackagePayment::latest()->paginate($per_page);

select * from `package_payments` where `package_payments`.`id` = '75' and `package_payments`.`deleted_at` is null limit 1
---
    public function package_payment_invoice($id)
    {
        $payment = PackagePayment::findOrFail($id);