app/Http/Controllers/PackageController.php

    public function select_package()
    {
        $packages = Package::where('active', '1');
        if (get_setting('free_package_activation') != 1) {
            $packages = $packages->where('id', '!=', 1);
        }
        $packages = $packages->get();
---
select * from `packages` where `id` = 9 and `packages`.`deleted_at` is null limit 1

    public function package_payemnt_methods($id)
    {
        $manual_payments = ManualPaymentMethod::all();
---
select * from `manual_payment_methods`