app/Http/Controllers/PaypalController.php

select * from `currencies` where `currencies`.`id` = '28' and `currencies`.`deleted_at` is null limit 1
---
    public function pay()
    {
      // dd(Session::get('payment_data')['amount']);
        // Creating an environment
        $clientId     = env('PAYPAL_CLIENT_ID');
        $clientSecret = env('PAYPAL_CLIENT_SECRET');

        if (get_setting('paypal_sandbox') == 1) {
            $environment = new SandboxEnvironment($clientId, $clientSecret);
        }
        else {
            $environment = new ProductionEnvironment($clientId, $clientSecret);
        }
        $client       = new PayPalHttpClient($environment);

        if(Session::has('payment_type')){
            $amount = Session::get('payment_data')['amount'];
        }

        $request = new OrdersCreateRequest();
        $request->prefer('return=representation');

        // PayPal always uses USD for better compatibility and to avoid currency restrictions
        // Get system default currency
        $systemCurrency = \App\Models\Currency::findOrFail(get_setting('system_default_currency'));

select * from `currencies` where `code` = 'USD' and `currencies`.`deleted_at` is null limit 1
---
        // Convert amount to USD if system currency is not USD
        if ($systemCurrencyCode !== 'USD') {
            // Get USD currency for exchange rate reference
            $usdCurrency = \App\Models\Currency::where('code', 'USD')->first();