app/Http/Controllers/StateController.php

select * from `states` where `country_id` is null and `states`.`deleted_at` is null
---
    public function get_state_by_country(Request $request)
    {
        $states = State::where('country_id', $request->country_id)->get();