app/Http/Controllers/SunSignController.php

    public function getMoonSignsBySunSign($id)
    {
        try {
            $sun_sign = SunSign::findOrFail($id);
            $moon_sign_ids = $sun_sign->moon_sign_ids ?? [];

            if (empty($moon_sign_ids)) {
                return response()->json([
                    'success' => true,
                    'moon_signs' => []
                ]);
            }

            $moon_signs = MoonSign::whereIn('id', $moon_sign_ids)
                ->orderBy('name')
                ->get(['id', 'name']);
---
select * from `sun_signs` where `sun_signs`.`id` = '12' and `sun_signs`.`deleted_at` is null limit 1
select `id`, `name` from `moon_signs` where `id` in ('33', '20', '19') and `moon_signs`.`deleted_at` is null order by `name` asc